Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# TextViewPorthole.ConfirmHeading
source: Confirm
de: Bestätigen
ja: 確認
pt_br: Confirmar
ru: Подтверждение
zh_hans: 确认

# TextViewPorthole.OpenFileConfirmation
source: Open file at %@?
de: Datei unter %@ öffnen?
ja: %@ のファイルを開きますか?
pt_br: Abrir o arquivo em %@?
ru: Открыть файл по пути %@?
zh_hans: 要打开位于 %@ 的文件吗？

# TextViewPorthole.OpenURLConfirmation
source: Open URL %@?
de: URL %@ öffnen?
ja: URL %@ を開きますか?
pt_br: Abrir a URL %@?
ru: Открыть URL %@?
zh_hans: 要打开 URL %@ 吗？

# Tip.000.Body
source: This window shows the iTerm2 tip of the day. It’ll appear every 24 hours to let you know about new features and hidden secrets. Hit “More Options” to view more tips or to stop getting them altogether.
de: Dieses Fenster zeigt den iTerm2-Tipp des Tages. Es erscheint alle 24 Stunden, um Sie über neue Funktionen und versteckte Geheimnisse zu informieren. Klicken Sie auf „Weitere Optionen“, um weitere Tipps anzuzeigen oder sie ganz zu deaktivieren.
ja: このウインドウには iTerm2 の今日のヒントが表示されます。新機能や隠された秘密を知らせるために、24 時間ごとに表示されます。「その他のオプション」をクリックすると、他のヒントを見たり、表示を完全に停止したりできます。
pt_br: Esta janela mostra a dica do dia do iTerm2. Ela aparece a cada 24 horas para informar sobre novos recursos e segredos ocultos. Clique em “Mais opções” para ver mais dicas ou para parar de recebê-las de vez.
ru: Это окно показывает совет дня iTerm2. Оно появляется каждые 24 часа, чтобы рассказать о новых функциях и скрытых возможностях. Нажмите «Дополнительные параметры», чтобы просмотреть другие советы или полностью отключить их показ.
zh_hans: 此窗口显示 iTerm2 每日提示。每24小时出现一次，用于告知您新功能和隐藏功能。点击“更多选项”可查看更多提示或完全停止接收。

# Tip.0000.Body
source: The big new feature of iTerm2 version 3 is Shell Integration. Click “Learn More” for all the details.
de: Die große neue Funktion von iTerm2 Version 3 ist die Shell-Integration. Klicken Sie auf „Mehr erfahren“ für alle Details.
ja: iTerm2 バージョン 3 の大きな新機能はシェル統合です。詳細については「詳しく見る」をクリックしてください。
pt_br: O grande novo recurso da versão 3 do iTerm2 é a Shell Integration. Clique em “Saiba mais” para todos os detalhes.
ru: Главной новой функцией iTerm2 версии 3 является Shell Integration. Нажмите «Подробнее», чтобы узнать больше.
zh_hans: iTerm2 版本3的全新重要功能是Shell集成。点击“了解更多”可获取所有细节。

# Tip.000.Title
source: Tip of the Day
de: Tipp des Tages
ja: 今日のヒント
pt_br: Dica do dia
ru: Совет дня
zh_hans: 每日提示

# Tip.0001.Body
source: “View > Show Timestamps” shows the time (and date, if appropriate) when each line was last modified.
de: „Ansicht > Zeitstempel anzeigen“ zeigt die Uhrzeit (und gegebenenfalls das Datum) an, zu der jede Zeile zuletzt geändert wurde.
ja: 「表示 > タイムスタンプを表示」で、各行が最後に変更された時刻 (必要に応じて日付も) が表示されます。
pt_br: “Visualizar > Mostrar carimbos de data e hora” mostra a hora (e a data, quando apropriado) em que cada linha foi modificada pela última vez.
ru: «Вид > Показать метки времени» показывает время (а при необходимости и дату) последнего изменения каждой строки.
zh_hans: “View > Show Timestamps” 显示每行最后被修改的时间（及日期，如适用）。

# Tip.0001.Title
source: Timestamps
de: Zeitstempel
ja: タイムスタンプ
pt_br: Carimbos de data e hora
ru: Метки времени
zh_hans: 时间戳

# Tip.0002.Body
source: Did you know iTerm2 has a password manager? Open it with “Window > Password Manager.” You can define a Trigger to open it for you at a password prompt in “Settings > Profiles > Advanced > Triggers.”
de: Wussten Sie, dass iTerm2 einen Passwort-Manager hat? Öffnen Sie ihn über „Fenster > Passwort-Manager“. Sie können einen Trigger definieren, der ihn bei einer Passwortabfrage automatisch öffnet, unter „Einstellungen > Profile > Erweitert > Trigger“.
ja: iTerm2 にパスワードマネージャーがあるのをご存知ですか? 「ウインドウ > パスワードマネージャー」から開けます。「設定 > プロファイル > 詳細 > トリガー」でトリガーを定義すれば、パスワードプロンプトで自動的に開かせることもできます。
pt_br: Você sabia que o iTerm2 tem um cofre de senhas? Abra-o em “Janela > Cofre de senhas”. Você pode definir um gatilho para abri-lo automaticamente em um prompt de senha em “Ajustes > Perfis > Avançado > Gatilhos”.
ru: Знаете ли вы, что в iTerm2 есть менеджер паролей? Откройте его через «Окно > Менеджер паролей». Вы можете настроить триггер, который будет открывать его автоматически при появлении запроса пароля, в «Настройки > Профили > Дополнительно > Триггеры».
zh_hans: 你知道 iTerm2 有密码管理器吗？通过“Window > Password Manager”打开它。你可以在“Settings > Profiles > Advanced > Triggers”中定义触发器，在密码输入提示时自动打开它。

# Tip.0002.Title
source: Password Manager
de: Passwort-Manager
ja: パスワードマネージャー
pt_br: Cofre de senhas
ru: Менеджер паролей
zh_hans: 密码管理器

# Tip.0003.Body
source: You can quickly search through your sessions with “View > Open Quickly” (⇧⌘O). You can type a query and sessions whose name, badge, current hostname, current user name, recent commands, and recent working directories match will be surfaced. It works best with Shell Integration so the user name, hostname, command, and directories can be known even while sshed.
de: Sie können Ihre Sitzungen schnell durchsuchen mit „Ansicht > Schnell öffnen“ (⇧⌘O). Sie können eine Suchanfrage eingeben, und Sitzungen, deren Name, Badge, aktueller Hostname, aktueller Benutzername, letzte Befehle oder letzte Arbeitsverzeichnisse übereinstimmen, werden angezeigt. Am besten funktioniert dies mit Shell-Integration, damit Benutzername, Hostname, Befehl und Verzeichnisse auch bei einer SSH-Verbindung bekannt sind.
ja: 「表示 > すばやく開く」(⇧⌘O) を使うと、セッションをすばやく検索できます。クエリを入力すると、名前、バッジ、現在のホスト名、現在のユーザー名、最近のコマンド、最近の作業ディレクトリが一致するセッションが表示されます。シェル統合と併用すると、SSH 接続中でもユーザー名、ホスト名、コマンド、ディレクトリを把握できるため、最も効果的に機能します。
pt_br: Você pode buscar rapidamente entre suas sessões com “Visualizar > Abrir rapidamente” (⇧⌘O). Você pode digitar uma consulta e as sessões cujo nome, selo, nome de host atual, nome de usuário atual, comandos recentes e diretórios de trabalho recentes correspondam serão exibidas. Funciona melhor com a Shell Integration, para que o nome de usuário, o nome de host, o comando e os diretórios possam ser conhecidos mesmo durante uma conexão ssh.
ru: Вы можете быстро искать среди своих сессий с помощью «Вид > Быстрое открытие» (⇧⌘O). Введите запрос, и будут показаны сессии, у которых совпадает имя, значок, текущее имя узла, текущее имя пользователя, недавние команды или недавние рабочие каталоги. Лучше всего это работает с Shell Integration, поскольку тогда имя пользователя, имя узла, команда и каталоги известны даже при подключении по SSH.
zh_hans: 您可以使用“View > Open Quickly” (⇧⌘O) 快速搜索会话。您可以输入查询内容，名称、角标、当前主机名、当前用户名、最近命令以及最近工作目录匹配的会话将被显示出来。此功能在 Shell Integration 下效果最佳，这样即使在 sshed 状态下也能知道用户名、主机名、命令和目录。

# Tip.0003.Title
source: Open Quickly
de: Schnell öffnen
ja: すばやく開く
pt_br: Abrir rapidamente
ru: Быстрое открытие
zh_hans: 快速打开

# Tip.0004.Body
source: If you close a session, tab, or window by accident you can undo it with “Edit > Undo” (⌘Z). By default you have five seconds to undo, but you can adjust that timeout in “Settings > Profiles > Session.”
de: Wenn Sie versehentlich eine Sitzung, einen Tab oder ein Fenster schließen, können Sie dies mit „Bearbeiten > Widerrufen“ (⌘Z) rückgängig machen. Standardmäßig haben Sie fünf Sekunden Zeit dafür, Sie können dieses Zeitlimit jedoch unter „Einstellungen > Profile > Sitzung“ anpassen.
ja: セッション、タブ、ウインドウを誤って閉じてしまった場合は、「編集 > 取り消す」(⌘Z) で元に戻せます。デフォルトでは取り消せる時間は 5 秒間ですが、「設定 > プロファイル > セッション」でそのタイムアウトを調整できます。
pt_br: Se você fechar uma sessão, aba ou janela por acidente, pode desfazer com “Editar > Desfazer” (⌘Z). Por padrão, você tem cinco segundos para desfazer, mas pode ajustar esse tempo limite em “Ajustes > Perfis > Sessão”.
ru: Если вы случайно закрыли сессию, вкладку или окно, это можно отменить с помощью «Правка > Отменить» (⌘Z). По умолчанию у вас есть пять секунд на отмену, но этот интервал можно изменить в «Настройки > Профили > Сессия».
zh_hans: 如果您不小心关闭了会话、标签页或窗口，可以使用“Edit > Undo” (⌘Z) 进行撤销操作。默认情况下，您有五秒的撤销时间，但可以在“Settings > Profiles > Session”中调整此超时时间。

# Tip.0004.Title
source: Undo Close
de: Schließen widerrufen
ja: 閉じる操作を取り消す
pt_br: Desfazer fechamento
ru: Отмена закрытия
zh_hans: 撤销关闭操作

# Tip.0005.Body
source: Want to mark up your scrollback history? Right click on a selection and choose “Annotate Selection” to add a personal note to it. Use “View > Show Annotations” to show or hide them, and look in “Edit > Marks and Annotations” for more things you can do.
de: Möchten Sie Ihren Scrollback-Verlauf markieren? Klicken Sie mit der rechten Maustaste auf eine Auswahl und wählen Sie „Auswahl kommentieren“, um eine persönliche Notiz hinzuzufügen. Verwenden Sie „Ansicht > Anmerkungen anzeigen“, um sie ein- oder auszublenden, und schauen Sie unter „Bearbeiten > Marken und Anmerkungen“ nach weiteren Möglichkeiten.
ja: スクロールバックの履歴にマークを付けたいですか? 選択範囲を右クリックして「選択範囲に注釈を付ける」を選ぶと、個人的なメモを追加できます。「表示 > 注釈を表示」で表示・非表示を切り替えられます。また、「編集 > マークと注釈」には他にもできることがあります。
pt_br: Quer marcar seu histórico de rolagem? Clique com o botão direito em uma seleção e escolha “Anotar seleção” para adicionar uma nota pessoal a ela. Use “Visualizar > Mostrar anotações” para mostrá-las ou ocultá-las e veja em “Editar > Marcas e anotações” mais coisas que você pode fazer.
ru: Хотите делать пометки в истории прокрутки? Щёлкните правой кнопкой мыши по выделению и выберите «Аннотировать выделение», чтобы добавить к нему личную заметку. Используйте «Вид > Показать аннотации», чтобы показать или скрыть их, а в «Правка > Метки и аннотации» вы найдёте другие возможности.
zh_hans: 想要标记滚动回退历史记录吗？右键点击选择项，然后选择“Annotate Selection”为它添加个人注释。使用“View > Show Annotations”可以显示或隐藏这些注释，更多操作可参考“Edit > Marks and Annotations”。

# Tip.0005.Title
source: Annotations
de: Anmerkungen
ja: 注釈
pt_br: Anotações
ru: Аннотации
zh_hans: 注释功能

# Tip.0006.Body
source: Copy a selection with ⌥⌘C to include styles such as colors and fonts. You can make this the default action for Copy in “Settings > Advanced.”
de: Kopieren Sie eine Auswahl mit ⌥⌘C, um Stile wie Farben und Schriftarten einzuschließen. Sie können dies unter „Einstellungen > Erweitert“ zur Standardaktion für „Kopieren“ machen.
ja: ⌥⌘C で選択範囲をコピーすると、色やフォントなどのスタイルも含められます。「設定 > 詳細」でこれをコピーのデフォルト動作にすることもできます。
pt_br: Copie uma seleção com ⌥⌘C para incluir estilos como cores e fontes. Você pode tornar esta a ação padrão para Copiar em “Ajustes > Avançado”.
ru: Скопируйте выделение с помощью ⌥⌘C, чтобы сохранить стили, такие как цвета и шрифты. Вы можете сделать это действием по умолчанию для команды «Копировать» в «Настройки > Дополнительно».
zh_hans: 使用 ⌥⌘C 复制选中的内容，可包含颜色、字体等样式。你可以在“设置 > 高级”中将此设为复制的默认操作。

# Tip.0006.Title
source: Copy with Styles
de: Mit Stilen kopieren
ja: スタイル付きでコピー
pt_br: Copiar com estilos
ru: Копирование со стилями
zh_hans: 带样式的复制

# Tip.0007.Body
source: iTerm2 can display images (even animated GIFs) inline.
de: iTerm2 kann Bilder (auch animierte GIFs) direkt im Text anzeigen.
ja: iTerm2 は画像 (アニメーション GIF も含む) をインラインで表示できます。
pt_br: O iTerm2 pode exibir imagens (até GIFs animados) em linha.
ru: iTerm2 может отображать изображения (даже анимированные GIF) прямо в тексте.
zh_hans: iTerm2 可以直接在文本中显示图片（包括动画 GIF）。

# Tip.0007.Title
source: Inline Images
de: Inline-Bilder
ja: インライン画像
pt_br: Imagens em linha
ru: Встроенные изображения
zh_hans: 内联图片

# Tip.0008.Body
source: Automatic Profile Switching changes the current profile when the username, hostname, or directory changes. Set it up in “Settings > Profiles > Advanced.” It requires Shell Integration to be installed.
de: Die automatische Profilumschaltung wechselt das aktuelle Profil, wenn sich Benutzername, Hostname oder Verzeichnis ändert. Richten Sie sie unter „Einstellungen > Profile > Erweitert“ ein. Dafür muss die Shell-Integration installiert sein.
ja: 自動プロファイル切り替えは、ユーザー名、ホスト名、ディレクトリが変わると現在のプロファイルを切り替えます。「設定 > プロファイル > 詳細」で設定してください。シェル統合がインストールされている必要があります。
pt_br: A Troca automática de perfil altera o perfil atual quando o nome de usuário, o nome de host ou o diretório mudam. Configure em “Ajustes > Perfis > Avançado”. Requer a instalação da Shell Integration.
ru: Автоматическое переключение профилей меняет текущий профиль при изменении имени пользователя, имени узла или каталога. Настройте это в «Настройки > Профили > Дополнительно». Для этого требуется установленный Shell Integration.
zh_hans: 自动配置文件切换会在用户名、主机名或目录发生变化时更改当前配置文件。可在“设置 > 配置文件 > 高级”中配置此功能，需安装Shell集成组件。

# Tip.0008.Title
source: Automatic Profile Switching
de: Automatische Profilumschaltung
ja: 自動プロファイル切り替え
pt_br: Troca automática de perfil
ru: Автоматическое переключение профилей
zh_hans: 自动配置文件切换

# Tip.0009.Body
source: iTerm2 can act like an IDE using the Captured Output feature. When it sees text matching a regular expression you define, like compiler errors, it shows the matching lines in the Toolbelt. You can click to jump to the line in your terminal and double-click to perform an action like opening an editor to the line with the error.
de: iTerm2 kann sich dank der Funktion „Aufgezeichnete Ausgabe“ wie eine IDE verhalten. Wenn Text erkannt wird, der einem von Ihnen definierten regulären Ausdruck entspricht, etwa Compilerfehler, werden die passenden Zeilen im Werkzeugkasten angezeigt. Sie können darauf klicken, um zur entsprechenden Zeile im Terminal zu springen, und doppelklicken, um eine Aktion auszuführen, etwa einen Editor an der Zeile mit dem Fehler zu öffnen.
ja: iTerm2 は、キャプチャした出力機能を使うことで IDE のように振る舞うことができます。コンパイラのエラーなど、定義した正規表現に一致するテキストを検出すると、一致した行をツールベルトに表示します。クリックするとターミナル内のその行にジャンプでき、ダブルクリックするとエラーのある行でエディタを開くなどのアクションを実行できます。
pt_br: O iTerm2 pode funcionar como uma IDE usando o recurso Saída capturada. Quando detecta um texto que corresponde a uma expressão regular definida por você, como erros do compilador, ele mostra as linhas correspondentes na Caixa de ferramentas. Você pode clicar para ir até a linha no seu terminal e clicar duas vezes para executar uma ação, como abrir um editor na linha com o erro.
ru: iTerm2 может работать подобно IDE благодаря функции «Захват вывода». Когда он видит текст, соответствующий заданному вами регулярному выражению, например ошибки компилятора, он показывает совпадающие строки в Toolbelt. Вы можете щёлкнуть, чтобы перейти к строке в терминале, и дважды щёлкнуть, чтобы выполнить действие, например открыть редактор на строке с ошибкой.
zh_hans: iTerm2可通过捕获输出功能模拟IDE环境。当检测到符合您定义的正则表达式的文本（如编译错误）时，会在Toolbelt中显示匹配行。您可以点击跳转到终端中的对应行，双击可对该错误行执行操作，例如打开编辑器。

# Tip.0009.Title
source: Captured Output
de: Aufgezeichnete Ausgabe
ja: キャプチャした出力
pt_br: Saída capturada
ru: Захват вывода
zh_hans: 捕获输出

# Tip.0010.Body
source: You can display a status message in the top right of your session in the background. It’s called a “Badge.” If you install Shell Integration you can include info like user name, hostname, current directory, and more.
de: Sie können im Hintergrund oben rechts in Ihrer Sitzung eine Statusmeldung anzeigen lassen. Das nennt sich „Badge“. Wenn Sie die Shell-Integration installieren, können Sie Informationen wie Benutzername, Hostname, aktuelles Verzeichnis und mehr einbeziehen.
ja: セッションの右上背景にステータスメッセージを表示できます。これは「バッジ」と呼ばれます。シェル統合をインストールすると、ユーザー名、ホスト名、現在のディレクトリなどの情報を含めることができます。
pt_br: Você pode exibir uma mensagem de status no canto superior direito da sua sessão, ao fundo. Ela é chamada de “selo”. Se você instalar a Shell Integration, poderá incluir informações como nome de usuário, nome de host, diretório atual e muito mais.
ru: Вы можете отображать статусное сообщение в правом верхнем углу вашей сессии на заднем плане. Это называется «Значок» (Badge). Если установить Shell Integration, в него можно включить такую информацию, как имя пользователя, имя узла, текущий каталог и многое другое.
zh_hans: 您可以在会话的右上角后台显示状态消息，称为“角标”。若安装Shell集成组件，可包含用户名、主机名、当前目录等信息。

# Tip.0011.Body
source: Dynamic Profiles let you store your profiles as one or more JSON files. It’s great for batch creating and editing profiles.
de: Mit Dynamischen Profilen können Sie Ihre Profile als eine oder mehrere JSON-Dateien speichern. Das eignet sich hervorragend, um Profile im großen Stil zu erstellen und zu bearbeiten.
ja: ダイナミックプロファイルを使うと、プロファイルを1つ以上のJSONファイルとして保存できます。プロファイルの一括作成や編集に最適です。
pt_br: Os Perfis dinâmicos permitem armazenar seus perfis como um ou mais arquivos JSON. É ótimo para criar e editar perfis em lote.
ru: Динамические профили позволяют хранить ваши профили в виде одного или нескольких файлов JSON. Это отлично подходит для пакетного создания и редактирования профилей.
zh_hans: 动态配置文件允许你将配置文件存储为一个或多个JSON文件。非常适合批量创建和编辑配置文件。

# Tip.0011.Title
source: Dynamic Profiles
de: Dynamische Profile
ja: ダイナミックプロファイル
pt_br: Perfis dinâmicos
ru: Динамические профили
zh_hans: 动态配置文件

# Tip.0012.Body
source: “Edit > Paste Special > Advanced Paste” lets you preview and edit text before you paste. You get to tweak options, like how to handle control codes, or even to base-64 encode before pasting.
de: Mit „Bearbeiten > Spezielles Einfügen > Erweitertes Einfügen“ können Sie Text vor dem Einfügen in der Vorschau ansehen und bearbeiten. Sie können Optionen anpassen, etwa wie mit Steuercodes umgegangen wird, oder den Text vor dem Einfügen sogar Base64-codieren.
ja: 「編集 > 特殊なペースト > 高度なペースト」を使うと、ペーストする前にテキストをプレビューして編集できます。制御コードの扱い方や、ペースト前にBase64エンコードするかどうかなど、オプションを細かく調整できます。
pt_br: “Editar > Colar especial > Colagem avançada” permite visualizar e editar o texto antes de colar. Você pode ajustar opções, como lidar com códigos de controle ou até codificar em base-64 antes de colar.
ru: «Правка > Специальная вставка > Расширенная вставка» позволяет просмотреть и отредактировать текст перед вставкой. Вы можете настроить параметры, например способ обработки управляющих кодов, или даже закодировать текст в base-64 перед вставкой.
zh_hans: “编辑 > 特殊粘贴 > 高级粘贴”功能可让你在粘贴前预览和编辑文本。你可以调整选项，例如如何处理控制码，甚至可以在粘贴前进行Base64编码。

# Tip.0012.Title
source: Advanced Paste
de: Erweitertes Einfügen
ja: 高度なペースト
pt_br: Colagem avançada
ru: Расширенная вставка
zh_hans: 高级粘贴

# Tip.0013.Body
source: Ever wanted to focus on a block of lines without distraction, or limit Find to a single command’s output? Select the lines and choose “View > Zoom In on Selection.” The session’s contents will be temporarily replaced with the selection. Press “esc” to unzoom.
de: Wollten Sie schon einmal ungestört auf einen Block von Zeilen fokussieren oder die Suche auf die Ausgabe eines einzelnen Befehls beschränken? Wählen Sie die Zeilen aus und klicken Sie auf „Ansicht > In Auswahl hineinzoomen“. Der Inhalt der Sitzung wird vorübergehend durch die Auswahl ersetzt. Drücken Sie „Esc“, um herauszuzoomen.
ja: 気が散らずに行のまとまりに集中したい、あるいは検索を1つのコマンドの出力だけに絞りたいと思ったことはありませんか?行を選択して「表示 > 選択範囲にズームイン」を選んでください。セッションの内容が一時的に選択範囲に置き換わります。ズームを解除するには「esc」を押します。
pt_br: Já quis focar em um bloco de linhas sem distrações ou limitar a busca à saída de um único comando? Selecione as linhas e escolha “Visualizar > Ampliar seleção”. O conteúdo da sessão será temporariamente substituído pela seleção. Pressione “esc” para reduzir.
ru: Хотите сосредоточиться на блоке строк без отвлекающих факторов или ограничить поиск выводом только одной команды? Выделите строки и выберите «Вид > Увеличить выделенную область». Содержимое сессии будет временно заменено выделением. Нажмите «esc», чтобы вернуться обратно.
zh_hans: 是否曾希望专注于一段行内容而不被干扰，或将查找范围限制于单一命令的输出？选中这些行后选择“查看 > 放大所选内容”。该会话的内容将暂时被所选内容替换。按“esc”键可取消放大。

# Tip.0014.Body
source: The “Semantic History” feature allows you to ⌘-click on a file or URL to open it.
de: Mit der Funktion „Semantischer Verlauf“ können Sie bei gedrückter ⌘-Taste auf eine Datei oder URL klicken, um sie zu öffnen.
ja: 「セマンティックヒストリー」機能を使うと、ファイルやURLを⌘クリックして開くことができます。
pt_br: O recurso “Semantic History” permite clicar com ⌘ em um arquivo ou URL para abri-lo.
ru: Функция «Семантическая история» позволяет открыть файл или URL-адрес щелчком с ⌘.
zh_hans: “语义历史”功能允许您使用⌘-点击文件或URL来打开它。

# Tip.0014.Title
source: Semantic History
de: Semantischer Verlauf
ja: セマンティックヒストリー
ru: Семантическая история
zh_hans: 语义历史

# Tip.0015.Body
source: If you use tmux, try running “tmux -CC” to get iTerm2’s tmux integration mode. The tmux windows show up as native iTerm2 windows, and you can use iTerm2’s keyboard shortcuts. It even works over ssh!
de: Wenn Sie tmux verwenden, probieren Sie „tmux -CC“ aus, um den tmux-Integrationsmodus von iTerm2 zu aktivieren. Die tmux-Fenster erscheinen dann als native iTerm2-Fenster, und Sie können die Tastaturkürzel von iTerm2 verwenden. Es funktioniert sogar über ssh!
ja: tmuxを使っているなら、「tmux -CC」を実行してiTerm2のtmux統合モードを試してみてください。tmuxのウィンドウがネイティブのiTerm2ウィンドウとして表示され、iTerm2のキーボードショートカットも使えます。sshごしでも動作します!
pt_br: Se você usa o tmux, tente executar “tmux -CC” para obter o modo de integração com o tmux do iTerm2. As janelas do tmux aparecem como janelas nativas do iTerm2, e você pode usar os atalhos de teclado do iTerm2. Funciona até por ssh!
ru: Если вы используете tmux, попробуйте запустить «tmux -CC», чтобы включить режим интеграции iTerm2 с tmux. Окна tmux отображаются как обычные окна iTerm2, и вы можете использовать сочетания клавиш iTerm2. Это работает даже через ssh!
zh_hans: 如果您使用tmux，尝试运行“tmux -CC”以进入iTerm2的tmux集成模式。tmux窗口会以原生iTerm2窗口的形式显示，您还可以使用iTerm2的键盘快捷键。甚至可以在ssh环境下使用！

# Tip.0016.Body
source: iTerm2 can automatically perform actions you define when text matching a regular expression is received. For example, you can highlight text or show an alert box. Set it up in “Settings > Profiles > Advanced > Triggers.”
de: iTerm2 kann automatisch von Ihnen definierte Aktionen ausführen, sobald Text empfangen wird, der einem regulären Ausdruck entspricht. Sie können beispielsweise Text hervorheben oder ein Warnfenster anzeigen lassen. Richten Sie dies unter „Einstellungen > Profile > Erweitert > Trigger“ ein.
ja: iTerm2では、正規表現に一致するテキストを受信したときに、あらかじめ定義したアクションを自動的に実行できます。たとえば、テキストをハイライトしたり、アラートボックスを表示したりできます。「設定 > プロファイル > 詳細 > トリガー」で設定してください。
pt_br: O iTerm2 pode executar automaticamente ações que você define quando um texto que corresponde a uma expressão regular é recebido. Por exemplo, você pode destacar um texto ou mostrar uma caixa de alerta. Configure em “Ajustes > Perfis > Avançado > Gatilhos”.
ru: iTerm2 может автоматически выполнять заданные вами действия, когда получен текст, соответствующий регулярному выражению. Например, можно выделить текст цветом или показать окно с предупреждением. Настройте это в «Настройки > Профили > Дополнительные > Триггеры».
zh_hans: 当文本匹配正则表达式时，iTerm2 可以自动执行您定义的操作。例如，您可以高亮显示文本或显示警告框。在“设置 > 配置文件 > 高级 > 触发器”中配置即可。

# Tip.0016.Title
source: Triggers
de: Trigger
ja: トリガー
pt_br: Gatilhos
ru: Триггеры
zh_hans: 触发器

# Tip.0017.Body
source: Quadruple click to perform Smart Selection. It figures out if you’re selecting a URL, filename, email address, etc. based on prioritized regular expressions.
de: Klicken Sie viermal, um die Intelligente Auswahl auszulösen. Anhand priorisierter regulärer Ausdrücke wird erkannt, ob Sie eine URL, einen Dateinamen, eine E-Mail-Adresse und so weiter auswählen.
ja: 4回クリックするとスマート選択が実行されます。優先順位付けされた正規表現に基づいて、URL、ファイル名、メールアドレスなどのどれを選択しようとしているかを自動的に判別します。
pt_br: Clique quatro vezes para usar a Seleção inteligente. Ela descobre se você está selecionando um URL, nome de arquivo, endereço de e-mail etc. com base em expressões regulares priorizadas.
ru: Четыре щелчка подряд запускают умное выделение. Оно определяет, что вы выделяете (URL-адрес, имя файла, адрес электронной почты и т. д.), на основе приоритизированных регулярных выражений.
zh_hans: 四次点击可触发智能选取。它根据优先级正则表达式判断您正在选择 URL、文件名、电子邮件地址等。

# Tip.0017.Title
source: Smart Selection
de: Intelligente Auswahl
ja: スマート選択
pt_br: Seleção inteligente
ru: Умное выделение
zh_hans: 智能选取
